### Staging environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 0s [id=196a92a2c10bfc2ffd05d0063a5f51b7]
data.azurerm_client_config.current: Reading...
data.azurerm_container_registry.main: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjdjZDRhMC0zZDE3LTRhMDUtODNlOS03NGIxMjRjMzIxNGQ7b2JqZWN0SWQ9NmI5N2EwZTMtZDM5OC00YmJmLWIyZmMtNmNjZmUxNzQ4ZDNlO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]
azurerm_user_assigned_identity.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-tshort-stage-westeurope-001]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.OperationalInsights/workspaces/log-tshort-stage-westeurope-001]
azurerm_static_web_app.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-stage-001]
azurerm_application_insights.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Insights/components/appi-tshort-stage-westeurope-001]
data.azurerm_container_registry.main: Read complete after 1s [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001]
azurerm_role_assignment.api_acr_pull: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001/providers/Microsoft.Authorization/roleAssignments/b63c4862-db8b-f2cf-44c7-d568ce41984b]
azurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-stage-westeurope-001]
cloudflare_record.primary: Refreshing state... [id=4f70db14b86b939153a7df9ae5d6b58e]
time_sleep.wait_for_dns_record: Refreshing state... [id=2025-01-02T23:41:06Z]
azurerm_static_web_app_custom_domain.primary: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-stage-001/customDomains/staging.admin.tshort.me]
azurerm_container_app.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001]
cloudflare_record.api: Refreshing state... [id=7305d7ea2fcc322e796a9a57b812d181]
cloudflare_record.asuid_api: Refreshing state... [id=c3db2340e04caaa5426c7b876eb01345]
time_sleep.api_custom_domain_records: Refreshing state... [id=2025-01-03T17:02:16Z]
azurerm_container_app_custom_domain.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001/customDomainName/staging.tshort.me]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azapi_resource.managed_certificate will be created
  + resource "azapi_resource" "managed_certificate" {
      + body                      = {
          + properties = {
              + domainControlValidation = "CNAME"
              + subjectName             = "staging.tshort.me"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "westeurope"
      + name                      = "aca-tshort-api-stage-001"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-stage-westeurope-001"
      + response_export_values    = [
          + "*",
        ]
      + schema_validation_enabled = true
      + type                      = "Microsoft.App/managedEnvironments/managedCertificates@2024-03-01"
    }

  # azapi_resource_action.apply_custom_domain_binding will be created
  + resource "azapi_resource_action" "apply_custom_domain_binding" {
      + body        = {
          + properties = {
              + configuration = {
                  + ingress = {
                      + customDomains = [
                          + {
                              + bindingType   = "SniEnabled"
                              + certificateId = (known after apply)
                              + name          = "staging.tshort.me"
                            },
                        ]
                    }
                }
            }
        }
      + id          = (known after apply)
      + method      = "PATCH"
      + output      = (known after apply)
      + resource_id = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001"
      + type        = "Microsoft.App/containerApps@2024-03-01"
      + when        = "apply"
    }

  # azapi_resource_action.destroy_custom_domain_binding will be created
  + resource "azapi_resource_action" "destroy_custom_domain_binding" {
      + body        = {
          + properties = {
              + configuration = {
                  + ingress = {
                      + customDomains = []
                    }
                }
            }
        }
      + id          = (known after apply)
      + method      = "PATCH"
      + output      = (known after apply)
      + resource_id = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001"
      + type        = "Microsoft.App/containerApps@2024-03-01"
      + when        = "destroy"
    }

  # azurerm_container_app.api will be updated in-place
  ~ resource "azurerm_container_app" "api" {
        id                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001"
        name                          = "aca-tshort-api-stage-001"
        tags                          = {
            "environment" = "Staging"
            "managed-by"  = "Terraform"
            "project"     = "TShort"
        }
      - workload_profile_name         = "Consumption" -> null
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "crtshortwesteurope001.azurecr.io/tshort-api:789bf2143175723a17034aa9873b739714c0c2a4" -> "crtshortwesteurope001.azurecr.io/placeholder"
                name              = "tshort-api"
                # (5 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>